platformio/platform-atmelavr/misc/svd/attiny861.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTB</name>
      <description>I/O Port</description>
      <baseAddress>0x36</baseAddress>
      <registers>
        <register>
          <name>DDRB</name>
          <description>Port B Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin B4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin B5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin B6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin B7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PINB</name>
          <description>Port B Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin B4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin B5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin B6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin B7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTB</name>
          <description>Port B Data Register</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin B4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin B5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin B6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin B7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <description>Timer/Counter0</description>
      <baseAddress>0x32</baseAddress>
      <registers>
        <register>
          <name>OCR0A</name>
          <description>Timer/Counter0 Output Compare Register</description>
          <addressOffset>0x1</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR0B</name>
          <description>Timer/Counter0 Output Compare Register</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR0A</name>
          <description>Timer/Counter  Control Register A</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>WGM00</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ACIC0</name>
              <description>Analog Comparator Input Capture Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICES0</name>
              <description>Input Capture Edge Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICNC0</name>
              <description>Input Capture Noice Canceler</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ICEN0</name>
              <description>Input Capture Mode Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TCW0</name>
              <description>Timer/Counter 0 Width</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0B</name>
          <description>Timer/Counter Control Register B</description>
          <addressOffset>0x21</addressOffset>
          <fields>
            <field>
              <name>CS0</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues><name>CS0</name><usage>read-write</usage><enumeratedValue><name>NO_CLOCK</name><description>No clock source (Timer/Counter stopped)</description><value>0</value></enumeratedValue><enumeratedValue><name>DIRECT</name><description>Running, No Prescaling</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALE_8</name><description>Running, CLK/8</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALE_64</name><description>Running, CLK/64</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALE_256</name><description>Running, CLK/256</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALE_1024</name><description>Running, CLK/1024</description><value>5</value></enumeratedValue><enumeratedValue><name>EXT_FALLING</name><description>Running, ExtClk Tx Falling Edge</description><value>6</value></enumeratedValue><enumeratedValue><name>EXT_RISING</name><description>Running, ExtClk Tx Rising Edge</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PSR0</name>
              <description>Timer/Counter 0 Prescaler Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT0H</name>
          <description>Timer/Counter0 High</description>
          <addressOffset>0x2</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCNT0L</name>
          <description>Timer/Counter0 Low</description>
          <addressOffset>0x20</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR</name>
          <description>Timer/Counter0 Interrupt Flag register</description>
          <addressOffset>0x26</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ICF0</name>
              <description>Timer/Counter0 Input Capture Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TOV0</name>
              <description>Timer/Counter0 Overflow Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCF0B</name>
              <description>Timer/Counter0 Output Compare Flag 0B</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCF0A</name>
              <description>Timer/Counter0 Output Compare Flag 0A</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK</name>
          <description>Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x27</addressOffset>
          <fields>
            <field>
              <name>TICIE0</name>
              <description>Timer/Counter0 Input Capture Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TOIE0</name>
              <description>Timer/Counter0 Overflow Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCIE0B</name>
              <description>Timer/Counter0 Output Compare Match B Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCIE0A</name>
              <description>Timer/Counter0 Output Compare Match A Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
