platformio/platform-atmelavr/misc/svd/attiny861.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC1</name>
      <description>Timer/Counter1, 10-bit</description>
      <baseAddress>0x20</baseAddress>
      <registers>
        <register>
          <name>DT1</name>
          <description>Timer/Counter 1 Dead Time Value</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>DT1L</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DT1H</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[7:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR1A</name>
          <description>Output Compare Register</description>
          <addressOffset>0x2D</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1B</name>
          <description>Output Compare Register</description>
          <addressOffset>0x2C</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1C</name>
          <description>Output compare register</description>
          <addressOffset>0x2B</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR1D</name>
          <description>Output compare register</description>
          <addressOffset>0x2A</addressOffset>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TC1H</name>
          <description>Timer/Counter High Bits</description>
          <addressOffset>0x25</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR1A</name>
          <description>Timer/Counter Control Register A</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PWM1B</name>
              <description>Pulse Width Modulator Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM1A</name>
              <description>Pulse Width Modulator Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FOC1B</name>
              <description>Force Output Compare Match 1B</description>
              <bitRange>[2:2]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>FOC1A</name>
              <description>Force Output Compare Match 1A</description>
              <bitRange>[3:3]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>COM1B</name>
              <description>Compare Output Mode, Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>COM1B</name><usage>read-write</usage><enumeratedValue><name>DISCONNECTED</name><description>Normal port operation, OCix disconnected</description><value>0</value></enumeratedValue><enumeratedValue><name>MATCH_TOGGLE</name><description>Toggle OCix on Compare Match (Might depend on WGM)</description><value>1</value></enumeratedValue><enumeratedValue><name>MATCH_CLEAR</name><description>Clear OCix on Compare Match (If PWM is enabled, OCix is set at TOP)</description><value>2</value></enumeratedValue><enumeratedValue><name>MATCH_SET</name><description>Set OCix on Compare Match (If PWM is enabled, OCix is cleared at TOP)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM1A</name>
              <description>Compare Output Mode, Bits</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues derivedFrom="COM1B" />
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1B</name>
          <description>Timer/Counter Control Register B</description>
          <addressOffset>0x2F</addressOffset>
          <fields>
            <field>
              <name>CS1</name>
              <description>Clock Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues><name>CS1</name><usage>read-write</usage><enumeratedValue><name>NO_CLOCK</name><description>No clock source (Timer/Counter stopped)</description><value>0</value></enumeratedValue><enumeratedValue><name>DIRECT</name><description>Running, No Prescaling</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALE_2</name><description>Running, CLK/2</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALE_4</name><description>Running, CLK/4</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALE_8</name><description>Running, CLK/8</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALE_16</name><description>Running, CLK/16</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALE_32</name><description>Running, CLK/32</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALE_64</name><description>Running, CLK/64</description><value>7</value></enumeratedValue><enumeratedValue><name>PRESCALE_128</name><description>Running, CLK/128</description><value>8</value></enumeratedValue><enumeratedValue><name>PRESCALE_256</name><description>Running, CLK/256</description><value>9</value></enumeratedValue><enumeratedValue><name>PRESCALE_512</name><description>Running, CLK/512</description><value>10</value></enumeratedValue><enumeratedValue><name>PRESCALE_1024</name><description>Running, CLK/1024</description><value>11</value></enumeratedValue><enumeratedValue><name>PRESCALE_2048</name><description>Running, CLK/2048</description><value>12</value></enumeratedValue><enumeratedValue><name>PRESCALE_4096</name><description>Running, CLK/4096</description><value>13</value></enumeratedValue><enumeratedValue><name>PRESCALE_8192</name><description>Running, CLK/8192</description><value>14</value></enumeratedValue><enumeratedValue><name>PRESCALE_16384</name><description>Running, CLK/16384</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DTPS1</name>
              <description>Dead Time Prescaler</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>DTPS1</name><usage>read-write</usage><enumeratedValue><name>X1</name><description>1x (no division)</description><value>0</value></enumeratedValue><enumeratedValue><name>X2</name><description>2x</description><value>1</value></enumeratedValue><enumeratedValue><name>X4</name><description>4x</description><value>2</value></enumeratedValue><enumeratedValue><name>X8</name><description>8x</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PSR1</name>
              <description>Timer/Counter 1 Prescaler reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM1X</name>
              <description>PWM Inversion Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1C</name>
          <description>Timer/Counter Control Register C</description>
          <addressOffset>0x27</addressOffset>
          <fields>
            <field>
              <name>PWM1D</name>
              <description>Pulse Width Modulator D Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FOC1D</name>
              <description>Force Output Compare Match 1D</description>
              <bitRange>[1:1]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>COM1D</name>
              <description>Comparator D output mode</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>COM1D</name><usage>read-write</usage><enumeratedValue><name>DISCONNECTED</name><description>Normal port operation, OCix disconnected</description><value>0</value></enumeratedValue><enumeratedValue><name>MATCH_TOGGLE</name><description>Toggle OCix on Compare Match (Might depend on WGM)</description><value>1</value></enumeratedValue><enumeratedValue><name>MATCH_CLEAR</name><description>Clear OCix on Compare Match (If PWM is enabled, OCix is set at TOP)</description><value>2</value></enumeratedValue><enumeratedValue><name>MATCH_SET</name><description>Set OCix on Compare Match (If PWM is enabled, OCix is cleared at TOP)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM1B0S</name>
              <description>COM1B0 Shadow Bit</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COM1B1S</name>
              <description>COM1B1 Shadow Bit</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>COM1A0S</name>
              <description>COM1A0 Shadow Bit</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>COM1A1S</name>
              <description>COM1A1 Shadow Bit</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1D</name>
          <description>Timer/Counter Control Register D</description>
          <addressOffset>0x26</addressOffset>
          <fields>
            <field>
              <name>WGM1</name>
              <description>Waveform Generation Mode Bit</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues><name>WGM1</name><usage>read-write</usage><enumeratedValue><name>PWM_FAST</name><description>Fast PWM, Update: *TOP*, Flag: *TOP*</description><value>0</value></enumeratedValue><enumeratedValue><name>PWM_CORRECT</name><description>Phase and Frequency Correct PWM, Update: *BOTTOM*, Flag: *BOTTOM*</description><value>1</value></enumeratedValue><enumeratedValue><name>PWM_SINGLE_SLOPE</name><description>PWM6 / Single-slope, Update: *TOP*, Flag: *TOP*</description><value>2</value></enumeratedValue><enumeratedValue><name>PWM_DUAL_SLOPE</name><description>PWM6 / Dual-slope, Update: *BOTTOM*, Flag: *BOTTOM*</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FPF1</name>
              <description>Fault Protection Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FPAC1</name>
              <description>Fault Protection Analog Comparator Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FPES1</name>
              <description>Fault Protection Edge Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>FPNC1</name>
              <description>Fault Protection Noise Canceler</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FPEN1</name>
              <description>Fault Protection Mode Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FPIE1</name>
              <description>Fault Protection Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1E</name>
          <description>Timer/Counter1 Control Register E</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OC1OE</name>
              <description>Ouput Compare Override Enable Bits</description>
              <bitRange>[5:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT1</name>
          <description>Timer/Counter Register</description>
          <addressOffset>0x2E</addressOffset>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR</name>
          <description>Timer/Counter Interrupt Flag Register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>TOV1</name>
              <description>Timer/Counter1 Overflow Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OCF1B</name>
              <description>Timer/Counter1 Output Compare Flag 1B</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OCF1A</name>
              <description>Timer/Counter1 Output Compare Flag 1A</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OCF1D</name>
              <description>Timer/Counter1 Output Compare Flag 1D</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK</name>
          <description>Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <fields>
            <field>
              <name>TOIE1</name>
              <description>Timer/Counter1 Overflow Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OCIE1B</name>
              <description>OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OCIE1A</name>
              <description>OCIE1A: Timer/Counter1 Output Compare Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OCIE1D</name>
              <description>OCIE1D: Timer/Counter1 Output Compare Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
